# Структура квиза
quiz_data = [
    {
        "question": "Какая столица Франции?",
        "options": ["Париж", "Марсель", "Лион", "Тулуза"],
        "correct_option": 0
    },
    {
        "question": "Какая самая высокая гора в мире?",
        "options": ["Эверест", "К2", "Монблан", "Килиманджаро"],
        "correct_option": 0
    },
    {
        "question": "Кто написал роман 'Война и мир'?",
        "options": ["Достоевский", "Толстой", "Пушкин", "Чехов"],
        "correct_option": 1
    },
    {
        "question": "Какой химический элемент обозначается символом H?",
        "options": ["Гелий", "Водород", "Гидроген", "Гелиум"],
        "correct_option": 1
    },
    {
        "question": "Какая планета Солнечной системы известна своими кольцами?",
        "options": ["Юпитер", "Сатурн", "Уран", "Нептун"],
        "correct_option": 1
    },
    {
        "question": "Кто изобрел электрическую лампочку?",
        "options": ["Эдисон", "Тесла", "Фарадей", "Ома"],
        "correct_option": 0
    },
    {
        "question": "Какая река протекает через Москву?",
        "options": ["Волга", "Дон", "Ока", "Москва-река"],
        "correct_option": 3
    },
    {
        "question": "Какой материал используется для изготовления монет?",
        "options": ["Золото", "Серебро", "Медь", "Алюминий"],
        "correct_option": 2
    },
    {
        "question": "Какая страна известна своими пирамидами?",
        "options": ["Египет", "Мексика", "Перу", "Китай"],
        "correct_option": 0
    },
    {
        "question": "Какой химический элемент обозначается символом O?",
        "options": ["Кислород", "Озон", "Оксид", "Окись"],
        "correct_option": 0
    },
    {
        "question": "Какая самая популярная операционная система для персональных компьютеров?",
        "options": ["macOS", "Linux", "Windows", "ChromeOS"],
        "correct_option": 2
    },
    {
        "question": "Какой океан расположен между Северной Америкой и Европой?",
        "options": ["Тихий океан", "Индийский океан", "Атлантический океан", "Северный Ледовитый океан"],
        "correct_option": 2
    },
    {
        "question": "Какая самая большая планета Солнечной системы?",
        "options": ["Сатурн", "Юпитер", "Уран", "Нептун"],
        "correct_option": 1
    }
]